sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cmp.h
/*!
    \file    gd32a7xx_cmp.h
    \brief   definitions for the CMP

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#ifndef GD32A7XX_CMP_H
#define GD32A7XX_CMP_H

#include "gd32a7xx.h"

/* CMP definitions */
#define CMP0                                     (CMP_BASE + 0x00001000U)       /*!< CMP0 base address */
#define CMP1                                     (CMP_BASE + 0x00000000U)       /*!< CMP1 base address */

/* registers definitions */
#define CMP_CS(CMPx)                             REG32((CMPx) + 0x00000000U)    /*!< CMPx control and status register */

#define CMP_RRCTL(CMPx)                          REG32((CMPx) + 0x00000010U)    /*!< CMPx Round robin control register 0 */
#define CMP_RRCHCTL(CMPx)                        REG32((CMPx) + 0x00000014U)    /*!< CMPx Round robin control register 1 */
#define CMP_RRCOMO(CMPx)                         REG32((CMPx) + 0x00000018U)    /*!< CMPx Round robin control and status register */
#define CMP_RRCOMF(CMPx)                         REG32((CMPx) + 0x0000001CU)    /*!< CMPx Round robin status register */
#define CMP_RRTCTL(CMPx)                         REG32((CMPx) + 0x00000020U)    /*!< CMPx Round robin trigger timer control register */
#define CMP_RRTTRGV(CMPx)                        REG32((CMPx) + 0x00000024U)    /*!< CMPx Round robin trigger timer value register */
#define CMP_RRTCNT(CMPx)                         REG32((CMPx) + 0x00000028U)    /*!< CMPx Round robin timer counter register */

/* bits definitions */
/* CMPx_CS */
#define CMP_CS_CMPXEN                            BIT(0)                         /*!< CMPx enable */
#define CMP_CS_CMPXM                             BITS(2,3)                      /*!< CMPx mode */
#define CMP_CS_CMPXMESEL                         BITS(4,6)                      /*!< CMP_IM external input selection */
#define CMP_CS_CMPXMISEL                         BITS(7,9)                      /*!< CMP_IM internal input selection */
#define CMP_CS_CMPXPESEL                         BITS(10,12)                    /*!< CMP_IP external input selection */
#define CMP_CS_CMPXPSEL                          BIT(13)                        /*!< CMP_IP input selection */
#define CMP_CS_CMPXPL                            BIT(15)                        /*!< CMPx output polarity */
#define CMP_CS_CMPXHST                           BITS(16,17)                    /*!< CMPx hysteresis */
#define CMP_CS_CMPXBLK                           BITS(18,20)                    /*!< CMPx output blanking source */
#define CMP_CS_CMPXBEN                           BIT(22)                        /*!< CMPx scaler bridge enable bit */
#define CMP_CS_CMPXSEN                           BIT(23)                        /*!< CMPx voltage input scaler */
#define CMP_CS_CMPXOSEL                          BITS(24,25)                    /*!< CMPx output selection */
#define CMP_CS_CMPXMESEL3                        BIT(26)                        /*!< CMP_IM external input selection */
#define CMP_CS_CMPXPESEL3                        BIT(27)                        /*!< CMP_IP external input selection */
#define CMP_CS_CMPXO                             BIT(30)                        /*!< CMPx output state */
#define CMP_CS_CMPXLK                            BIT(31)                        /*!< CMPx lock */

/* CMP_RRCTL */
#define CMP_RRCTL_RREN                           BIT(0)                         /*!< CMP round robin enable */
#define CMP_RRCTL_RRSAMCFG                       BITS(8,9)                      /*!< CMP round robin sample clocks configuration */
#define CMP_RRCTL_RRTINIT                        BITS(16,21)                    /*!< CMP round robin time initialization */
#define CMP_RRCTL_RRIE                           BIT(31)                        /*!< interrupt enable for round robin */

/* CMP_RRCHCTL */
#define CMP_RRCHCTL_NSPECH0EN                    BIT(0)                         /*!< CMP round robin non-specified mux port channel 0 enable */
#define CMP_RRCHCTL_NSPECH1EN                    BIT(1)                         /*!< CMP round robin non-specified mux port channel 1 enable */
#define CMP_RRCHCTL_NSPECH2EN                    BIT(2)                         /*!< CMP round robin non-specified mux port channel 2 enable */
#define CMP_RRCHCTL_NSPECH3EN                    BIT(3)                         /*!< CMP round robin non-specified mux port channel 3 enable */
#define CMP_RRCHCTL_NSPECH4EN                    BIT(4)                         /*!< CMP round robin non-specified mux port channel 4 enable */
#define CMP_RRCHCTL_NSPECH5EN                    BIT(5)                         /*!< CMP round robin non-specified mux port channel 5 enable */
#define CMP_RRCHCTL_NSPECH6EN                    BIT(6)                         /*!< CMP round robin non-specified mux port channel 6 enable */
#define CMP_RRCHCTL_NSPECH7EN                    BIT(7)                         /*!< CMP round robin non-specified mux port channel 7 enable */
#define CMP_RRCHCTL_NSPECH8EN                    BIT(8)                         /*!< CMP round robin non-specified mux port channel 8 enable(only for CMP0) */
#define CMP_RRCHCTL_NSPECH9EN                    BIT(9)                         /*!< CMP round robin non-specified mux port channel 9 enable(only for CMP0) */
#define CMP_RRCHCTL_NSPECH10EN                   BIT(10)                        /*!< CMP round robin non-specified mux port channel 10 enable(only for CMP0) */
#define CMP_RRCHCTL_SPEPS                        BIT(16)                        /*!< CMP round robin specified port selection */
#define CMP_RRCHCTL_RRSPECHS                     BITS(20,23)                    /*!< CMP round robin specified channel selection */

