sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cmp.h
/* CMP_RRCOMO */
#define CMP_RRCOMO_CH0COMO                       BIT(0)                         /*!< CMP round robin channel 0 compare output state */
#define CMP_RRCOMO_CH1COMO                       BIT(1)                         /*!< CMP round robin channel 1 compare output state */
#define CMP_RRCOMO_CH2COMO                       BIT(2)                         /*!< CMP round robin channel 2 compare output state */
#define CMP_RRCOMO_CH3COMO                       BIT(3)                         /*!< CMP round robin channel 3 compare output state */
#define CMP_RRCOMO_CH4COMO                       BIT(4)                         /*!< CMP round robin channel 4 compare output state */
#define CMP_RRCOMO_CH5COMO                       BIT(5)                         /*!< CMP round robin channel 5 compare output state */
#define CMP_RRCOMO_CH6COMO                       BIT(6)                         /*!< CMP round robin channel 6 compare output state */
#define CMP_RRCOMO_CH7COMO                       BIT(7)                         /*!< CMP round robin channel 7 compare output state */
#define CMP_RRCOMO_CH8COMO                       BIT(8)                         /*!< CMP round robin channel 8 compare output state(only for CMP0) */
#define CMP_RRCOMO_CH9COMO                       BIT(9)                         /*!< CMP round robin channel 9 compare output state(only for CMP0) */
#define CMP_RRCOMO_CH10COMO                      BIT(10)                        /*!< CMP round robin channel 10 compare output state(only for CMP0) */

/* CMP_RRCOMF */
#define CMP_RRCOMF_CH0COMF                       BIT(0)                         /*!< CMP round robin channel 0 compare result flag */
#define CMP_RRCOMF_CH1COMF                       BIT(1)                         /*!< CMP round robin channel 1 compare result flag */
#define CMP_RRCOMF_CH2COMF                       BIT(2)                         /*!< CMP round robin channel 2 compare result flag */
#define CMP_RRCOMF_CH3COMF                       BIT(3)                         /*!< CMP round robin channel 3 compare result flag */
#define CMP_RRCOMF_CH4COMF                       BIT(4)                         /*!< CMP round robin channel 4 compare result flag */
#define CMP_RRCOMF_CH5COMF                       BIT(5)                         /*!< CMP round robin channel 5 compare result flag */
#define CMP_RRCOMF_CH6COMF                       BIT(6)                         /*!< CMP round robin channel 6 compare result flag */
#define CMP_RRCOMF_CH7COMF                       BIT(7)                         /*!< CMP round robin channel 7 compare result flag */
#define CMP_RRCOMF_CH8COMF                       BIT(8)                         /*!< CMP round robin channel 8 compare result flag(only for CMP0) */
#define CMP_RRCOMF_CH9COMF                       BIT(9)                         /*!< CMP round robin channel 9 compare result flag(only for CMP0) */
#define CMP_RRCOMF_CH10COMF                      BIT(10)                        /*!< CMP round robin channel 10 compare result flag(only for CMP0) */

/* CMP_RRTCTL */
#define CMP_RRTCTL_RRCEN                          BIT(0)                        /*!< CMP round robin counter enable */
#define CMP_RRTCTL_RRTRGEN                        BIT(1)                        /*!< CMP round robin trigger enable */
#define CMP_RRTCTL_CLRCNT                         BIT(2)                        /*!< clear the RRCNT[31:0] value */
#define CMP_RRTCTL_UPVAL                          BIT(3)                        /*!< update the RRTVAL[31:0] value */

/* constants definitions */
/* CMP operating mode */
#define CS_CMPXM(regval)                         (BITS(2,3) & ((uint32_t)(regval) << 2U))
#define CMP_MODE_HIGHSPEED                       CS_CMPXM(0)                                            /*!< CMP mode high speed */
#define CMP_MODE_MIDDLESPEED                     CS_CMPXM(1)                                            /*!< CMP mode middle speed */
#define CMP_MODE_LOWSPEED                        CS_CMPXM(3)                                            /*!< CMP mode low speed */

/* CMP hysteresis */
#define CS_CMPXHST(regval)                       (BITS(16,17) & ((uint32_t)(regval) << 16U))
#define CMP_HYSTERESIS_NO                        CS_CMPXHST(0)                                          /*!< CMP output no hysteresis */
#define CMP_HYSTERESIS_LOW                       CS_CMPXHST(1)                                          /*!< CMP output low hysteresis */
#define CMP_HYSTERESIS_MIDDLE                    CS_CMPXHST(2)                                          /*!< CMP output middle hysteresis */
#define CMP_HYSTERESIS_HIGH                      CS_CMPXHST(3)                                          /*!< CMP output high hysteresis */

/* CMP inverting input */
#define CS_CMPXMISEL(regval)                     (BITS(7,9) & ((uint32_t)(regval) << 7U))
#define CS_CMPXMESEL(regval)                     (BITS(4,6) & ((uint32_t)(regval) << 4U))
#define CS_CMPXMESEL3(regval)                    (BIT(26) & ((uint32_t)(regval) << 26U))
#define CMP_INVERTING_INPUT_1_4VREFINT           CS_CMPXMISEL(0)                                        /*!< CMP inverting input 1/4 Vrefint */
#define CMP_INVERTING_INPUT_1_2VREFINT           CS_CMPXMISEL(1)                                        /*!< CMP inverting input 1/2 Vrefint */
#define CMP_INVERTING_INPUT_3_4VREFINT           CS_CMPXMISEL(2)                                        /*!< CMP inverting input 3/4 Vrefint */
#define CMP_INVERTING_INPUT_VREFINT              CS_CMPXMISEL(3)                                        /*!< CMP inverting input Vrefint */
#define CMP_INVERTING_INPUT_DAC_OUT              CS_CMPXMISEL(4)                                        /*!< CMP inverting input DAC0_OUT0 for CMP0 or DAC1_OUT0 for CMP1 */
#define CMP_INVERTING_INPUT_EXTERNAL_INPUT       CS_CMPXMISEL(5)                                        /*!< CMP inverting input when use round robin */
#define CMP_INVERTING_INPUT_PF5_PC6              (CS_CMPXMISEL(5) | CS_CMPXMESEL(0))                    /*!< CMP inverting input PF5 for CMP0 or PC6 for CMP1 */
#define CMP_INVERTING_INPUT_PF4_PG7              (CS_CMPXMISEL(5) | CS_CMPXMESEL(1))                    /*!< CMP inverting input PF4 for CMP0 or PG7 for CMP1 */
#define CMP_INVERTING_INPUT_PA2_PJ11             (CS_CMPXMISEL(5) | CS_CMPXMESEL(2))                    /*!< CMP inverting input PA2 for CMP0 or PJ11 for CMP1 */
#define CMP_INVERTING_INPUT_PC2_PA14             (CS_CMPXMISEL(5) | CS_CMPXMESEL(3))                    /*!< CMP inverting input PC2 for CMP0 or PA14 for CMP1 */
#define CMP_INVERTING_INPUT_PA1_PK1              (CS_CMPXMISEL(5) | CS_CMPXMESEL(4))                    /*!< CMP inverting input PA1 for CMP0 or PK1 for CMP1 */
#define CMP_INVERTING_INPUT_PF3_PK2              (CS_CMPXMISEL(5) | CS_CMPXMESEL(5))                    /*!< CMP inverting input PF3 for CMP0 or PK2 for CMP1 */
#define CMP_INVERTING_INPUT_PH2_PG2              (CS_CMPXMISEL(5) | CS_CMPXMESEL(6))                    /*!< CMP inverting input PH2 for CMP0 or PG2 for CMP1 */
#define CMP_INVERTING_INPUT_PH3_PG5              (CS_CMPXMISEL(5) | CS_CMPXMESEL(7))                    /*!< CMP inverting input PH3 for CMP0 or PG5 for CMP1 */
#define CMP_INVERTING_INPUT_PA14                 (CS_CMPXMISEL(5) | CS_CMPXMESEL(0) | CS_CMPXMESEL3(1)) /*!< CMP inverting input PA14(only for CMP0) */
#define CMP_INVERTING_INPUT_PC6                  (CS_CMPXMISEL(5) | CS_CMPXMESEL(1) | CS_CMPXMESEL3(1)) /*!< CMP inverting input PC6(only for CMP0) */
#define CMP_INVERTING_INPUT_PG7                  (CS_CMPXMISEL(5) | CS_CMPXMESEL(2) | CS_CMPXMESEL3(1)) /*!< CMP inverting input PG7(only for CMP0) */

/* CMP noninverting input */
#define CS_CMPXPSEL(regval)                      (BIT(13) & ((uint32_t)(regval) << 13U))
#define CS_CMPXPESEL(regval)                     (BITS(10,12) & ((uint32_t)(regval) << 10U))
#define CS_CMPXPESEL3(regval)                    (BIT(27) & ((uint32_t)(regval) << 27U))
#define CMP_NONINVERTING_DAC_OUT                 CS_CMPXPSEL(1)                                         /*!< CMP noninverting input DAC0_OUT0 for CMP0 or DAC1_OUT0 for CMP1 */
#define CMP_NONINVERTING_INPUT_PF5_PC6           (CS_CMPXPSEL(0) | CS_CMPXPESEL(0))                     /*!< CMP noninverting input PF5 for CMP0 or PC6 for CMP1 */
#define CMP_NONINVERTING_INPUT_PF4_PG7           (CS_CMPXPSEL(0) | CS_CMPXPESEL(1))                     /*!< CMP noninverting input PF4 for CMP0 or PG7 for CMP1 */
#define CMP_NONINVERTING_INPUT_PA2_PJ11          (CS_CMPXPSEL(0) | CS_CMPXPESEL(2))                     /*!< CMP noninverting input PA2 for CMP0 or PJ11 for CMP1 */
#define CMP_NONINVERTING_INPUT_PC2_PA14          (CS_CMPXPSEL(0) | CS_CMPXPESEL(3))                     /*!< CMP noninverting input PC2 for CMP0 or PA14 for CMP1 */
#define CMP_NONINVERTING_INPUT_PA1_PK1           (CS_CMPXPSEL(0) | CS_CMPXPESEL(4))                     /*!< CMP noninverting input PA1 for CMP0 or PK1 for CMP1 */
#define CMP_NONINVERTING_INPUT_PF3_PK2           (CS_CMPXPSEL(0) | CS_CMPXPESEL(5))                     /*!< CMP noninverting input PF3 for CMP0 or PK2 for CMP1 */
#define CMP_NONINVERTING_INPUT_PH2_PG2           (CS_CMPXPSEL(0) | CS_CMPXPESEL(6))                     /*!< CMP noninverting input PH2 for CMP0 or PG2 for CMP1 */
#define CMP_NONINVERTING_INPUT_PH3_PG5           (CS_CMPXPSEL(0) | CS_CMPXPESEL(7))                     /*!< CMP noninverting input PH3 for CMP0 or PG5 for CMP1 */
#define CMP_NONINVERTING_INPUT_PA14              (CS_CMPXPSEL(0) | CS_CMPXPESEL(0) | CS_CMPXPESEL3(1))  /*!< CMP noninverting input PA14(only for CMP0) */
#define CMP_NONINVERTING_INPUT_PC6               (CS_CMPXPSEL(0) | CS_CMPXPESEL(1) | CS_CMPXPESEL3(1))  /*!< CMP noninverting input PC6(only for CMP0) */
#define CMP_NONINVERTING_INPUT_PG7               (CS_CMPXPSEL(0) | CS_CMPXPESEL(2) | CS_CMPXPESEL3(1))  /*!< CMP noninverting input PG7(only for CMP0) */

/* CMP output polarity*/
#define CS_CMPXPL(regval)                        (BIT(15) & ((uint32_t)(regval) << 15U))
#define CMP_OUTPUT_POLARITY_NONINVERTED          CS_CMPXPL(0)                                           /*!< CMP output not inverted */
#define CMP_OUTPUT_POLARITY_INVERTED             CS_CMPXPL(1)                                           /*!< CMP output inverted */

/* CMP blanking source */
#define CS_CMPXBLK(regval)                       (BITS(18,20) & ((uint32_t)(regval) << 18U))
#define CMP_BLANKING_NONE                        CS_CMPXBLK(0)                                          /*!< CMP no blanking source */
#define CMP_BLANKING_TIMER0_OC1                  CS_CMPXBLK(1)                                          /*!< CMP TIMER0_CH1 output compare signal selected as blanking source */
#define CMP_BLANKING_TIMER7_OC1                  CS_CMPXBLK(2)                                          /*!< CMP TIMER7_CH1 output compare signal selected as blanking source */
#define CMP_BLANKING_TIMER1_OC1                  CS_CMPXBLK(3)                                          /*!< CMP TIMER1_CH1 output compare signal selected as blanking source */

