sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cmp.h
/* CMP output */
#define CS_CMPXOSEL(regval)                      (BITS(24,25) & ((uint32_t)(regval) << 24U))
#define CMP_OUTPUT_NONE                          CS_CMPXOSEL(0)                                         /*!< CMP output none */
#define CMP_OUTPUT_TIMER0_IC0_TIMER20_IC0        CS_CMPXOSEL(1)                                         /*!< CMP0 output TIMER0_CH0 input capture, CMP1 output TIMER20_CH0 input capture */
#define CMP_OUTPUT_TIMER7_IC0_TIMER60_IC0        CS_CMPXOSEL(2)                                         /*!< CMP0 output TIMER7_CH0 input capture, CMP1 output TIMER60_CH0 input capture */

/* CMP output level */
#define CMP_OUTPUTLEVEL_HIGH                     ((uint32_t)0x00000001U)                                /*!< comparator output high */
#define CMP_OUTPUTLEVEL_LOW                      ((uint32_t)0x00000000U)                                /*!< comparator output low */

/* CMP round robin specified channel definitions */
#define RRCHCTL_RRSPECHS(regval)                 (BITS(20,23) & ((uint32_t)(regval) << 20))
#define CMP_RRSPE_CHANNEL_0                      RRCHCTL_RRSPECHS(0)                                    /*!< CMP round robin channel 0 */
#define CMP_RRSPE_CHANNEL_1                      RRCHCTL_RRSPECHS(1)                                    /*!< CMP round robin channel 1 */
#define CMP_RRSPE_CHANNEL_2                      RRCHCTL_RRSPECHS(2)                                    /*!< CMP round robin channel 2 */
#define CMP_RRSPE_CHANNEL_3                      RRCHCTL_RRSPECHS(3)                                    /*!< CMP round robin channel 3 */
#define CMP_RRSPE_CHANNEL_4                      RRCHCTL_RRSPECHS(4)                                    /*!< CMP round robin channel 4 */
#define CMP_RRSPE_CHANNEL_5                      RRCHCTL_RRSPECHS(5)                                    /*!< CMP round robin channel 5 */
#define CMP_RRSPE_CHANNEL_6                      RRCHCTL_RRSPECHS(6)                                    /*!< CMP round robin channel 6 */
#define CMP_RRSPE_CHANNEL_7                      RRCHCTL_RRSPECHS(7)                                    /*!< CMP round robin channel 7 */
#define CMP_RRSPE_CHANNEL_8                      RRCHCTL_RRSPECHS(8)                                    /*!< CMP round robin channel 8 */
#define CMP_RRSPE_CHANNEL_9                      RRCHCTL_RRSPECHS(9)                                    /*!< CMP round robin channel 9 */
#define CMP_RRSPE_CHANNEL_10                     RRCHCTL_RRSPECHS(10)                                   /*!< CMP round robin channel 10 */

/* CMP round robin non-specified channel definitions */
#define CMP_RRNONSPE_CHANNEL_0                   ((uint32_t)0x00000001U)                                /*!< CMP round robin channel 0 */
#define CMP_RRNONSPE_CHANNEL_1                   ((uint32_t)0x00000002U)                                /*!< CMP round robin channel 1 */
#define CMP_RRNONSPE_CHANNEL_2                   ((uint32_t)0x00000004U)                                /*!< CMP round robin channel 2 */
#define CMP_RRNONSPE_CHANNEL_3                   ((uint32_t)0x00000008U)                                /*!< CMP round robin channel 3 */
#define CMP_RRNONSPE_CHANNEL_4                   ((uint32_t)0x00000010U)                                /*!< CMP round robin channel 4 */
#define CMP_RRNONSPE_CHANNEL_5                   ((uint32_t)0x00000020U)                                /*!< CMP round robin channel 5 */
#define CMP_RRNONSPE_CHANNEL_6                   ((uint32_t)0x00000040U)                                /*!< CMP round robin channel 6 */
#define CMP_RRNONSPE_CHANNEL_7                   ((uint32_t)0x00000080U)                                /*!< CMP round robin channel 7 */
#define CMP_RRNONSPE_CHANNEL_8                   ((uint32_t)0x00000100U)                                /*!< CMP round robin channel 8 */
#define CMP_RRNONSPE_CHANNEL_9                   ((uint32_t)0x00000200U)                                /*!< CMP round robin channel 9 */
#define CMP_RRNONSPE_CHANNEL_10                  ((uint32_t)0x00000400U)                                /*!< CMP round robin channel 10 */

/* CMP round robin specified port selection */
#define RRCHCTL_SPEPS(regval)                     (BIT(16) & ((uint32_t)(regval) << 16))
#define CMP_RRINVERTING_PORT                      RRCHCTL_SPEPS(0)                                      /*!< select the inverting port */
#define CMP_RRNONINVERTING_PORT                   RRCHCTL_SPEPS(1)                                      /*!< select the non-inverting port */

/* CMP round robin compare result flag */
#define CMP_FLAG_CH0COMF                         CMP_RRCOMF_CH0COMF                                     /*!< CMP round robin channel 0 compare result flag */
#define CMP_FLAG_CH1COMF                         CMP_RRCOMF_CH1COMF                                     /*!< CMP round robin channel 1 compare result flag */
#define CMP_FLAG_CH2COMF                         CMP_RRCOMF_CH2COMF                                     /*!< CMP round robin channel 2 compare result flag */
#define CMP_FLAG_CH3COMF                         CMP_RRCOMF_CH3COMF                                     /*!< CMP round robin channel 3 compare result flag */
#define CMP_FLAG_CH4COMF                         CMP_RRCOMF_CH4COMF                                     /*!< CMP round robin channel 4 compare result flag */
#define CMP_FLAG_CH5COMF                         CMP_RRCOMF_CH5COMF                                     /*!< CMP round robin channel 5 compare result flag */
#define CMP_FLAG_CH6COMF                         CMP_RRCOMF_CH6COMF                                     /*!< CMP round robin channel 6 compare result flag */
#define CMP_FLAG_CH7COMF                         CMP_RRCOMF_CH7COMF                                     /*!< CMP round robin channel 7 compare result flag */
#define CMP_FLAG_CH8COMF                         CMP_RRCOMF_CH8COMF                                     /*!< CMP round robin channel 8 compare result flag(only for CMP0) */
#define CMP_FLAG_CH9COMF                         CMP_RRCOMF_CH9COMF                                     /*!< CMP round robin channel 9 compare result flag(only for CMP0) */
#define CMP_FLAG_CH10COMF                        CMP_RRCOMF_CH10COMF                                    /*!< CMP round robin channel 10 compare result flag(only for CMP0) */

/* CMP round robin number of sample clocks */
#define RRCTL_RRSAMCFG(regval)                   (BITS(8,9) & ((uint32_t)(regval) << 8))
#define RRCTL_RRSAMCFG_0CLK                      RRCTL_RRSAMCFG(0)                                      /*!< round robin 0 sample clock */
#define RRCTL_RRSAMCFG_1CLK                      RRCTL_RRSAMCFG(1)                                      /*!< round robin 1 sample clock */
#define RRCTL_RRSAMCFG_2CLK                      RRCTL_RRSAMCFG(2)                                      /*!< round robin 2 sample clock */
#define RRCTL_RRSAMCFG_3CLK                      RRCTL_RRSAMCFG(3)                                      /*!< round robin 3 sample clock */

