sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cmp.h
/* CMP round robin initialization delay */
#define RRCTL_RRTINIT(regval)                    (BITS(16,21) & ((uint32_t)(regval) << 16))
#define RRCTL_RRTINIT_1CLK                       RRCTL_RRTINIT(1)                                       /*!< round robin initialization delay 1 clock */
#define RRCTL_RRTINIT_2CLK                       RRCTL_RRTINIT(2)                                       /*!< round robin initialization delay 2 clock */
#define RRCTL_RRTINIT_3CLK                       RRCTL_RRTINIT(3)                                       /*!< round robin initialization delay 3 clock */
#define RRCTL_RRTINIT_4CLK                       RRCTL_RRTINIT(4)                                       /*!< round robin initialization delay 4 clock */
#define RRCTL_RRTINIT_5CLK                       RRCTL_RRTINIT(5)                                       /*!< round robin initialization delay 5 clock */
#define RRCTL_RRTINIT_6CLK                       RRCTL_RRTINIT(6)                                       /*!< round robin initialization delay 6 clock */
#define RRCTL_RRTINIT_7CLK                       RRCTL_RRTINIT(7)                                       /*!< round robin initialization delay 7 clock */
#define RRCTL_RRTINIT_8CLK                       RRCTL_RRTINIT(8)                                       /*!< round robin initialization delay 8 clock */
#define RRCTL_RRTINIT_9CLK                       RRCTL_RRTINIT(9)                                       /*!< round robin initialization delay 9 clock */
#define RRCTL_RRTINIT_10CLK                      RRCTL_RRTINIT(10)                                      /*!< round robin initialization delay 10 clock */
#define RRCTL_RRTINIT_11CLK                      RRCTL_RRTINIT(11)                                      /*!< round robin initialization delay 11 clock */
#define RRCTL_RRTINIT_12CLK                      RRCTL_RRTINIT(12)                                      /*!< round robin initialization delay 12 clock */
#define RRCTL_RRTINIT_13CLK                      RRCTL_RRTINIT(13)                                      /*!< round robin initialization delay 13 clock */
#define RRCTL_RRTINIT_14CLK                      RRCTL_RRTINIT(14)                                      /*!< round robin initialization delay 14 clock */
#define RRCTL_RRTINIT_15CLK                      RRCTL_RRTINIT(15)                                      /*!< round robin initialization delay 15 clock */
#define RRCTL_RRTINIT_16CLK                      RRCTL_RRTINIT(16)                                      /*!< round robin initialization delay 16 clock */
#define RRCTL_RRTINIT_17CLK                      RRCTL_RRTINIT(17)                                      /*!< round robin initialization delay 17 clock */
#define RRCTL_RRTINIT_18CLK                      RRCTL_RRTINIT(18)                                      /*!< round robin initialization delay 18 clock */
#define RRCTL_RRTINIT_19CLK                      RRCTL_RRTINIT(19)                                      /*!< round robin initialization delay 19 clock */
#define RRCTL_RRTINIT_20CLK                      RRCTL_RRTINIT(20)                                      /*!< round robin initialization delay 20 clock */
#define RRCTL_RRTINIT_21CLK                      RRCTL_RRTINIT(21)                                      /*!< round robin initialization delay 21 clock */
#define RRCTL_RRTINIT_22CLK                      RRCTL_RRTINIT(22)                                      /*!< round robin initialization delay 22 clock */
#define RRCTL_RRTINIT_23CLK                      RRCTL_RRTINIT(23)                                      /*!< round robin initialization delay 23 clock */
#define RRCTL_RRTINIT_24CLK                      RRCTL_RRTINIT(24)                                      /*!< round robin initialization delay 24 clock */
#define RRCTL_RRTINIT_25CLK                      RRCTL_RRTINIT(25)                                      /*!< round robin initialization delay 25 clock */
#define RRCTL_RRTINIT_26CLK                      RRCTL_RRTINIT(26)                                      /*!< round robin initialization delay 26 clock */
#define RRCTL_RRTINIT_27CLK                      RRCTL_RRTINIT(27)                                      /*!< round robin initialization delay 27 clock */
#define RRCTL_RRTINIT_28CLK                      RRCTL_RRTINIT(28)                                      /*!< round robin initialization delay 28 clock */
#define RRCTL_RRTINIT_29CLK                      RRCTL_RRTINIT(29)                                      /*!< round robin initialization delay 29 clock */
#define RRCTL_RRTINIT_30CLK                      RRCTL_RRTINIT(30)                                      /*!< round robin initialization delay 30 clock */
#define RRCTL_RRTINIT_31CLK                      RRCTL_RRTINIT(31)                                      /*!< round robin initialization delay 31 clock */
#define RRCTL_RRTINIT_32CLK                      RRCTL_RRTINIT(32)                                      /*!< round robin initialization delay 32 clock */
#define RRCTL_RRTINIT_33CLK                      RRCTL_RRTINIT(33)                                      /*!< round robin initialization delay 33 clock */
#define RRCTL_RRTINIT_34CLK                      RRCTL_RRTINIT(34)                                      /*!< round robin initialization delay 34 clock */
#define RRCTL_RRTINIT_35CLK                      RRCTL_RRTINIT(35)                                      /*!< round robin initialization delay 35 clock */
#define RRCTL_RRTINIT_36CLK                      RRCTL_RRTINIT(36)                                      /*!< round robin initialization delay 36 clock */
#define RRCTL_RRTINIT_37CLK                      RRCTL_RRTINIT(37)                                      /*!< round robin initialization delay 37 clock */
#define RRCTL_RRTINIT_38CLK                      RRCTL_RRTINIT(38)                                      /*!< round robin initialization delay 38 clock */
#define RRCTL_RRTINIT_39CLK                      RRCTL_RRTINIT(39)                                      /*!< round robin initialization delay 39 clock */
#define RRCTL_RRTINIT_40CLK                      RRCTL_RRTINIT(40)                                      /*!< round robin initialization delay 40 clock */
#define RRCTL_RRTINIT_41CLK                      RRCTL_RRTINIT(41)                                      /*!< round robin initialization delay 41 clock */
#define RRCTL_RRTINIT_42CLK                      RRCTL_RRTINIT(42)                                      /*!< round robin initialization delay 42 clock */
#define RRCTL_RRTINIT_43CLK                      RRCTL_RRTINIT(43)                                      /*!< round robin initialization delay 43 clock */
#define RRCTL_RRTINIT_44CLK                      RRCTL_RRTINIT(44)                                      /*!< round robin initialization delay 44 clock */
#define RRCTL_RRTINIT_45CLK                      RRCTL_RRTINIT(45)                                      /*!< round robin initialization delay 45 clock */
#define RRCTL_RRTINIT_46CLK                      RRCTL_RRTINIT(46)                                      /*!< round robin initialization delay 46 clock */
#define RRCTL_RRTINIT_47CLK                      RRCTL_RRTINIT(47)                                      /*!< round robin initialization delay 47 clock */
#define RRCTL_RRTINIT_48CLK                      RRCTL_RRTINIT(48)                                      /*!< round robin initialization delay 48 clock */
#define RRCTL_RRTINIT_49CLK                      RRCTL_RRTINIT(49)                                      /*!< round robin initialization delay 49 clock */
#define RRCTL_RRTINIT_50CLK                      RRCTL_RRTINIT(50)                                      /*!< round robin initialization delay 50 clock */
#define RRCTL_RRTINIT_51CLK                      RRCTL_RRTINIT(51)                                      /*!< round robin initialization delay 51 clock */
#define RRCTL_RRTINIT_52CLK                      RRCTL_RRTINIT(52)                                      /*!< round robin initialization delay 52 clock */
#define RRCTL_RRTINIT_53CLK                      RRCTL_RRTINIT(53)                                      /*!< round robin initialization delay 53 clock */
#define RRCTL_RRTINIT_54CLK                      RRCTL_RRTINIT(54)                                      /*!< round robin initialization delay 54 clock */
#define RRCTL_RRTINIT_55CLK                      RRCTL_RRTINIT(55)                                      /*!< round robin initialization delay 55 clock */
#define RRCTL_RRTINIT_56CLK                      RRCTL_RRTINIT(56)                                      /*!< round robin initialization delay 56 clock */
#define RRCTL_RRTINIT_57CLK                      RRCTL_RRTINIT(57)                                      /*!< round robin initialization delay 57 clock */
#define RRCTL_RRTINIT_58CLK                      RRCTL_RRTINIT(58)                                      /*!< round robin initialization delay 58 clock */
#define RRCTL_RRTINIT_59CLK                      RRCTL_RRTINIT(59)                                      /*!< round robin initialization delay 59 clock */
#define RRCTL_RRTINIT_60CLK                      RRCTL_RRTINIT(60)                                      /*!< round robin initialization delay 60 clock */
#define RRCTL_RRTINIT_61CLK                      RRCTL_RRTINIT(61)                                      /*!< round robin initialization delay 61 clock */
#define RRCTL_RRTINIT_62CLK                      RRCTL_RRTINIT(62)                                      /*!< round robin initialization delay 62 clock */
#define RRCTL_RRTINIT_63CLK                      RRCTL_RRTINIT(63)                                      /*!< round robin initialization delay 63 clock */

