sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cmp.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check CMP peripherals */
#define NOT_CMP_PERIPH(cmp_periph)                       (((cmp_periph) != CMP0) && ((cmp_periph) != CMP1))

/* check CMP operating mode */
#define NOT_CMP_OPERATING_MODE(operating_mode)           (((operating_mode) != CMP_MODE_HIGHSPEED)   && ((operating_mode) != CMP_MODE_MIDDLESPEED) && \
                                                         ((operating_mode) != CMP_MODE_LOWSPEED))

/* check CMP output hysteresis */
#define NOT_CMP_OUTPUT_HYSTERESIS(output_hysteresis)     (((output_hysteresis) != CMP_HYSTERESIS_NO)     && ((output_hysteresis) != CMP_HYSTERESIS_LOW) && \
                                                         ((output_hysteresis) != CMP_HYSTERESIS_MIDDLE) && ((output_hysteresis) != CMP_HYSTERESIS_HIGH))

/* check CMP inverting input */
#define NOT_CMP_INVERTING_INPUT(inverting_input)         (((inverting_input) != CMP_INVERTING_INPUT_1_4VREFINT) && ((inverting_input) != CMP_INVERTING_INPUT_1_2VREFINT) && \
                                                         ((inverting_input) != CMP_INVERTING_INPUT_3_4VREFINT) && ((inverting_input) != CMP_INVERTING_INPUT_VREFINT) && \
                                                         ((inverting_input) != CMP_INVERTING_INPUT_DAC_OUT)    && ((inverting_input) != CMP_INVERTING_INPUT_PF5_PC6) && \
                                                         ((inverting_input) != CMP_INVERTING_INPUT_PF4_PG7)    && ((inverting_input) != CMP_INVERTING_INPUT_PA2_PJ11) && \
                                                         ((inverting_input) != CMP_INVERTING_INPUT_PC2_PA14)   && ((inverting_input) != CMP_INVERTING_INPUT_PA1_PK1) && \
                                                         ((inverting_input) != CMP_INVERTING_INPUT_PF3_PK2)    && ((inverting_input) != CMP_INVERTING_INPUT_PH2_PG2) && \
                                                         ((inverting_input) != CMP_INVERTING_INPUT_PH3_PG5)    && ((inverting_input) != CMP_INVERTING_INPUT_PA14) && \
                                                         ((inverting_input) != CMP_INVERTING_INPUT_PC6)        && ((inverting_input) != CMP_INVERTING_INPUT_PG7))

/* check CMP noninverting input */
#define NOT_CMP_NONINVERTING_INPUT(noninverting_input)   (((noninverting_input) != CMP_NONINVERTING_DAC_OUT)        && ((noninverting_input) != CMP_NONINVERTING_INPUT_PF5_PC6) && \
                                                         ((noninverting_input) != CMP_NONINVERTING_INPUT_PF4_PG7)  && ((noninverting_input) != CMP_NONINVERTING_INPUT_PA2_PJ11) && \
                                                         ((noninverting_input) != CMP_NONINVERTING_INPUT_PC2_PA14) && ((noninverting_input) != CMP_NONINVERTING_INPUT_PA1_PK1) && \
                                                         ((noninverting_input) != CMP_NONINVERTING_INPUT_PF3_PK2)  && ((noninverting_input) != CMP_NONINVERTING_INPUT_PH2_PG2) && \
                                                         ((noninverting_input) != CMP_NONINVERTING_INPUT_PH3_PG5)  && ((noninverting_input) != CMP_NONINVERTING_INPUT_PA14) && \
                                                         ((noninverting_input) != CMP_NONINVERTING_INPUT_PC6)      && ((noninverting_input) != CMP_NONINVERTING_INPUT_PG7))

/* check CMP output polarity */
#define NOT_CMP_OUTPUT_POLARITY(output_polarity)         (((output_polarity) != CMP_OUTPUT_POLARITY_NONINVERTED) && ((output_polarity) != CMP_OUTPUT_POLARITY_INVERTED))

/* check CMP blanking source selection */
#define NOT_CMP_BLK_SOURCE_SEL(blanking_source)          (((blanking_source) != CMP_BLANKING_NONE)       && ((blanking_source) != CMP_BLANKING_TIMER0_OC1) && \
                                                         ((blanking_source) != CMP_BLANKING_TIMER7_OC1) && ((blanking_source) != CMP_BLANKING_TIMER1_OC1))

/* check CMP output selection */
#define NOT_CMP_OUTPUT_SELECTION(output_selection)       (((output_selection) != CMP_OUTPUT_NONE)       && ((output_selection) != CMP_OUTPUT_TIMER0_IC0_TIMER20_IC0) && \
                                                         ((output_selection) != CMP_OUTPUT_TIMER7_IC0_TIMER60_IC0))

/* check CMP round robin specified channel */
#define NOT_CMP_SPECIFIED_CHANNEL(specified_channel)     (((specified_channel) != CMP_RRSPE_CHANNEL_0)  && ((specified_channel) != CMP_RRSPE_CHANNEL_1) && \
                                                         ((specified_channel) != CMP_RRSPE_CHANNEL_2)  && ((specified_channel) != CMP_RRSPE_CHANNEL_3) && \
                                                         ((specified_channel) != CMP_RRSPE_CHANNEL_4)  && ((specified_channel) != CMP_RRSPE_CHANNEL_5) && \
                                                         ((specified_channel) != CMP_RRSPE_CHANNEL_6)  && ((specified_channel) != CMP_RRSPE_CHANNEL_7) && \
                                                         ((specified_channel) != CMP_RRSPE_CHANNEL_8)  && ((specified_channel) != CMP_RRSPE_CHANNEL_9) && \
                                                         ((specified_channel) != CMP_RRSPE_CHANNEL_10))

/* check CMP round robin non_specified channel */
#define CMP_RR_NONSPE_CHANNEL_HIGH                       ((uint32_t)0x000007FFU)
#define NOT_CMP_NONSPE_CHANNEL(non_specified_channel)    (CMP_RR_NONSPE_CHANNEL_HIGH < (non_specified_channel))

/* check CMP round robin specified port */
#define NOT_CMP_SPECIFIED_PORT(specified_port)           (((specified_port) != CMP_RRNONINVERTING_PORT) && ((specified_port) != CMP_RRINVERTING_PORT))

/* check CMP round robin sample clock */
#define NOT_CMP_SAMPLE_CLOCK(sample_clock)               (((sample_clock) != RRCTL_RRSAMCFG_0CLK) && ((sample_clock) != RRCTL_RRSAMCFG_1CLK) && \
                                                         ((sample_clock) != RRCTL_RRSAMCFG_2CLK) && ((sample_clock) != RRCTL_RRSAMCFG_3CLK))
/* check CMP round robin initialization delay clock */
#define CMP_RR_INIT_DELAY_HIGH                           ((uint32_t)0x003F0000U)
#define CMP_RR_INIT_DELAY_CLOCK(init_delay)              (CMP_RR_INIT_DELAY_HIGH < (init_delay))

#endif

/* function declarations */
/* initialization functions */
/* deinitialize comparator */
void cmp_deinit(uint32_t cmp_periph);
/* initialize comparator mode */
void cmp_mode_init(uint32_t cmp_periph, uint32_t operating_mode, uint32_t inverting_input, uint32_t output_hysteresis);
/* initialize comparator input */
void cmp_noninverting_input_select(uint32_t cmp_periph, uint32_t noninverting_input);
/* initialize comparator output */
void cmp_output_init(uint32_t cmp_periph, uint32_t output_selection, uint32_t output_polarity);
/* initialize comparator blanking function */
void cmp_blanking_init(uint32_t cmp_periph, uint32_t blanking_source_selection);
/* initialize comparator round robin clock */
void cmp_roundrobin_clock_init(uint32_t cmp_periph, uint32_t sample_clock, uint32_t init_delay);
/* initialize comparator round robin channel config */
void cmp_roundrobin_channel_config(uint32_t cmp_periph, uint32_t specified_port, uint32_t specified_channel, uint32_t non_specified_channel);
/* initialize comparator round robin non-specified channel pre-set state */
void cmp_roundrobin_channel_preset(uint32_t cmp_periph, uint32_t non_specified_channel);
/* comparator round robin timer trigger value config */
void cmp_roundrobin_trigger_timer_value_config(uint32_t cmp_periph, uint32_t value);
/* comparator round robin timer trigger value reload */
void cmp_roundrobin_trigger_timer_value_reload(uint32_t cmp_periph);
/* comparator round robin timer counter clear */
void cmp_roundrobin_trigger_timer_counter_clear(uint32_t cmp_periph);

