sorosaulong-ux/gd32-test-project/Library/gd32a7xx_cmp.h
/* enable functions */
/* enable comparator */
void cmp_enable(uint32_t cmp_periph);
/* disable comparator */
void cmp_disable(uint32_t cmp_periph);
/* enable the voltage scaler */
void cmp_voltage_scaler_enable(uint32_t cmp_periph);
/* disable the voltage scaler */
void cmp_voltage_scaler_disable(uint32_t cmp_periph);
/* enable the scaler bridge */
void cmp_scaler_bridge_enable(uint32_t cmp_periph);
/* disable the scaler bridge */
void cmp_scaler_bridge_disable(uint32_t cmp_periph);
/* enable comparator round robin */
void cmp_roundrobin_enable(uint32_t cmp_periph);
/* disable comparator round robin */
void cmp_roundrobin_disable(uint32_t cmp_periph);
/* enable comparator round robin counter */
void cmp_roundrobin_trigger_timer_counter_enable(uint32_t cmp_periph);
/* disable comparator round robin counter */
void cmp_roundrobin_trigger_timer_counter_disable(uint32_t cmp_periph);
/* enable comparator round robin trigger */
void cmp_roundrobin_trigger_enable(uint32_t cmp_periph);
/* disable comparator round robin trigger */
void cmp_roundrobin_trigger_disable(uint32_t cmp_periph);
/* lock the comparator */
void cmp_lock_enable(uint32_t cmp_periph);

/* output functions */
/* get output level */
uint32_t cmp_output_level_get(uint32_t cmp_periph);

/* flag and interrupt functions */
/* get comparator round robin non-specified_channel compare result flag */
FlagStatus cmp_roundrobin_flag_get(uint32_t cmp_periph, uint32_t non_specified_channel);
/* clear comparator round robin non-specified_channel compare result flag */
void cmp_roundrobin_flag_clear(uint32_t cmp_periph, uint32_t non_specified_channel);
/* enable comparator round robin interrupt */
void cmp_roundrobin_interrupt_enable(uint32_t cmp_periph);
/* disable comparator round robin interrupt */
void cmp_roundrobin_interrupt_disable(uint32_t cmp_periph);

#endif /* GD32A7XX_CMP_H */
